app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."user_id" = 'k' LIMIT 1
SELECT COUNT(*) FROM "users" WHERE "users"."user_id" = 'bob' AND "users"."email" = 'l@g.com'
---
  def create
    if User.where(user_id: params[:user][:user_id], email: params[:user][:email]).empty?