app/controllers/users_controller.rb

SELECT 1 AS one FROM "users" WHERE "users"."user_id" = 'max' LIMIT 1
INSERT INTO "users" ("created_at", "email", "session_token", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", Thu, 09 Oct 2014 00:37:08 UTC +00:00], ["email", "email@email.com"], ["session_token", nil], ["updated_at", Thu, 09 Oct 2014 00:37:08 UTC +00:00], ["user_id", "max"]]
---
  def create
    if User.where(user_id: params[:user][:user_id]).empty?
        @user = User.create_user!(params[:user])